Revit 2027 API
ParameterTypeId.ThermalMaterialName Property
 "Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ThermalMaterialName { get; }
Public Shared ReadOnly Property ThermalMaterialName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ThermalMaterialName {
	ForgeTypeId^ get ();
}
static member ThermalMaterialName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace